import ServiceCard from "./ServiceCard";
import cardImage1 from "../assets/Images/cardImages/Frame 63.svg";
import cardImage2 from "../assets/Images/cardImages/Frame 64.svg";
import cardImage3 from "../assets/Images/cardImages/Frame 65.svg";

const card1Content = {
  title: `ДОМАШНЯ ПЕРЕТРИМКА`,
  description: [
    `Є двох видів: песик переселяється до оселі спеціаліста або ж навпаки.`,
    `За цей час песикодоглядач гуляє, годує, грається, робить усе, щоби песик не сумував.`,
  ],
  priceList: {
    service: [
      `1 доба / 90 хв прогулянок*`,
      `1 доба / 135 хв прогулянок*`,
      `1 доба / 180 хв прогулянок*`,
      `1 доба / 90 хв прогулянок*`,
    ],
    price: [`400`, `480`, `550`, `440`],
    additionalService: [
      "Додатковий песик",
      "Додатковий котик, гризунчик чи пірнатий",
    ],
    additionalServicePrice: [`+130`, "+0"],
  },
  note: `*Вказано загальний час прогулянок на добу, який ти сам розділяєш на кількість та їх тривалість`,
  alt: [`Заповнюємо анкету песика.`, `Знайомимось з песиком за день до перетримки.`, `Підписуємо договір.`, `Залишаємось у песика вдома чи забираємо до себе.`, `Гуляємо, годуємо та граємось, як звик хвостик.`, `Надсилаємо звіт з фото, відео та маршрутами двічі на день.`, `Залишаємось на зв’язку 24/7.`]
};

const card2Content = {
  title: `ПОСЛУГИ ВИГУЛЮВАЧА`,
  description: [
    `Вигулювач — це друг песика, який забере його на прогулянку, якщо трапилась халепа.`,
    `Опісля він помиє лапки, а за проханням ще й дасть смаколик або ж порцію корму.`,
  ],
  priceList: {
    service: [`Прогулянка 45 хв`, "Прогулянка 120 хв"],
    price: [`150`, `230`],
    additionalService: ["Додаткові 45 хв*", "Додатковий песик"],
    additionalServicePrice: [`+85`, "+80"],
  },
  note: `*Якщо непередбачувано хочеш продовжити прогулянку.`,
  alt: [`Заповнюємо анкету песика.`, `Знайомимось з песиком за день до прогулянки.`, `Підписуємо договір.`, `Забираємо песика за вказаною адресою.`, `Фіксуємо наш надійний повідець.`, `Гуляємо за вказаним маршрутом.`, `Миємо лапки та годуємо (якщо потрібно).`, `Надсилаємо звіт із картою маршруту, фото та відео.`]
};

const card3Content = {
  title: `ПОСЛУГИ ПЕСИКОНЯНІ`,
  description: [
    `Песиконяня — це людина, яка навідається до песика додому, аби пильнувати його.`,
    `На цей час ти залишаєш завдання: побавитися з цуценям, дати ліки, покидати м’ячик чи захистити кота.`,
  ],
  priceList: {
    service: [`Візит 60 хв`],
    price: [`150`],
    additionalService: ["Кожні наступні 60 хв*", "Додатковий песик"],
    additionalServicePrice: [`+80`, "+60"],
  },
  note: `*Цей час чи його частину можна використати для прогулянки.`,
  alt: [`Заповнюємо анкету песика.`, `Знайомимось з песиком за день до візиту.`, `Підписуємо договір.`, `Приходимо за вказаною адресою.`, `Виконуємо залишений список завдань.`, `Робимо додаткові почухасики.`, `Надсилаємо звіт із фото та відео.`]
};

export default function ServiceSection() {
  return (
    <div id="services" className="mx-auto mt-6 w-[90vw] 2xl:mt-36">
      <h2 className="text-center mb-16 text-lg h1 sm-400:text-xl md:text-[25px] 2xl:text-[40px] 2xl:mb-28">
        Що ми робимо?
      </h2>
      <div className="flex flex-wrap items-center justify-center gap-10 2xl:gap-32">
        <ServiceCard image={cardImage1} content={card1Content} />
        <ServiceCard image={cardImage2} content={card2Content} />
        <ServiceCard image={cardImage3} content={card3Content} />
      </div>
    </div>
  );
}
